Ran Plan for 5 projects:

1. project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
1. project: `crawlinghub-ecr-prod` dir: `terraform/ecr` workspace: `default`
1. project: `crawlinghub-ecs-cluster-prod` dir: `terraform/ecs-cluster` workspace: `default`
1. project: `crawlinghub-elasticache-prod` dir: `terraform/elasticache` workspace: `default`
1. project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
---

### 1. project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/41/default/terraform/ecs-scheduler/crawlinghub-ecs-scheduler-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/41/default/terraform/ecs-scheduler": exit status 1
╷
│ Error: Error acquiring the state lock
│ 
│ Error message: operation error DynamoDB: PutItem, https response error
│ StatusCode: 400, RequestID:
│ 1VHSA655MADC4SGU2EF8SQCDMFVV4KQNSO5AEMVJF66Q9ASUAAJG,
│ ConditionalCheckFailedException: The conditional request failed
│ Lock Info:
│   ID:        acb29368-7d40-d7fd-04c6-4687f3466cdd
│   Path:      prod-connectly/crawlinghub/ecs-scheduler/terraform.tfstate
│   Operation: OperationTypePlan
│   Who:       atlantis@ip-10-0-11-50.ap-northeast-2.compute.internal
│   Version:   1.8.1
│   Created:   2025-11-20 08:22:08.599786493 +0000 UTC
│   Info:      
│ 
│ 
│ Terraform acquires a state lock to protect the state from being written
│ by multiple users at the same time. Please resolve the issue above and try
│ again. For most commands, you can disable locking with the "-lock=false"
│ flag, but this is not recommended.
╵

```
</details>

---
### 2. project: `crawlinghub-ecr-prod` dir: `terraform/ecr` workspace: `default`
**Plan Error**
```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/41/default/terraform/ecr/crawlinghub-ecr-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/41/default/terraform/ecr": signal: killed


```

---
### 3. project: `crawlinghub-ecs-cluster-prod` dir: `terraform/ecs-cluster` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_ecs_cluster.main will be created
+ resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "crawlinghub-cluster-prod"
      + tags     = {
          + "Name" = "crawlinghub-cluster-prod"
        }
      + tags_all = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-cluster-prod"
          + "Project"     = "crawlinghub"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_cluster_capacity_providers.main will be created
+ resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "crawlinghub-cluster-prod"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 100
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ cluster_arn  = (known after apply)
+ cluster_id   = (known after apply)
+ cluster_name = "crawlinghub-cluster-prod"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p crawlinghub-ecs-cluster-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Fecs-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p crawlinghub-ecs-cluster-prod
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 4. project: `crawlinghub-elasticache-prod` dir: `terraform/elasticache` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.vpc_id: Read complete after 1s [id=/shared/network/vpc-id]
data.aws_ssm_parameter.private_subnets: Read complete after 1s [id=/shared/network/private-subnets]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_elasticache_cluster.redis will be created
+ resource "aws_elasticache_cluster" "redis" {
      + apply_immediately          = (known after apply)
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "crawlinghub-redis-prod"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "7.0"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = "mon:09:00-mon:10:00"
      + network_type               = (known after apply)
      + node_type                  = "cache.t3.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = "crawlinghub-redis-params-prod"
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = (known after apply)
      + snapshot_retention_limit   = 1
      + snapshot_window            = "05:00-09:00"
      + subnet_group_name          = "crawlinghub-redis-subnet-prod"
      + tags                       = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-redis-prod"
          + "Service"     = "crawlinghub-redis-prod"
        }
      + tags_all                   = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-redis-prod"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-redis-prod"
        }
      + transit_encryption_enabled = (known after apply)
    }

  # aws_elasticache_parameter_group.redis will be created
+ resource "aws_elasticache_parameter_group" "redis" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "redis7"
      + id          = (known after apply)
      + name        = "crawlinghub-redis-params-prod"
      + tags        = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-redis-params-prod"
        }
      + tags_all    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-redis-params-prod"
          + "Project"     = "crawlinghub"
        }

      + parameter {
          + name  = "maxmemory-policy"
          + value = "allkeys-lru"
        }
    }

  # aws_elasticache_subnet_group.redis will be created
+ resource "aws_elasticache_subnet_group" "redis" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "crawlinghub-redis-subnet-prod"
      + subnet_ids  = (sensitive value)
      + tags        = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-redis-subnet-prod"
        }
      + tags_all    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-redis-subnet-prod"
          + "Project"     = "crawlinghub"
        }
      + vpc_id      = (known after apply)
    }

  # aws_security_group.redis will be created
+ resource "aws_security_group" "redis" {
      + arn                    = (known after apply)
      + description            = "Security group for ElastiCache Redis"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = "Redis from ECS tasks"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "crawlinghub-redis-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "crawlinghub-redis-sg-prod"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-redis-sg-prod"
          + "Project"     = "crawlinghub"
        }
      + vpc_id                 = (sensitive value)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ redis_endpoint          = (known after apply)
+ redis_port              = 6379
+ redis_security_group_id = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p crawlinghub-elasticache-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FCrawlingHub%252Fterraform%252Felasticache%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p crawlinghub-elasticache-prod
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
### 5. project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/41/default/terraform/ecs-web-api/crawlinghub-ecs-web-api-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/41/default/terraform/ecs-web-api": exit status 1
data.aws_ecs_cluster.main: Reading...
data.aws_ssm_parameter.public_subnets: Reading...
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.certificate_arn: Reading...
data.aws_ecr_repository.web_api: Reading...
data.aws_secretsmanager_secret.rds: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
data.aws_ssm_parameter.route53_zone_id: Reading...
data.aws_ssm_parameter.route53_zone_id: Read complete after 1s [id=/shared/network/route53-zone-id]
data.aws_ssm_parameter.certificate_arn: Read complete after 1s [id=/shared/network/certificate-arn]
data.aws_ssm_parameter.private_subnets: Read complete after 1s [id=/shared/network/private-subnets]
data.aws_ssm_parameter.public_subnets: Read complete after 1s [id=/shared/network/public-subnets]
data.aws_ssm_parameter.vpc_id: Read complete after 1s [id=/shared/network/vpc-id]
data.aws_secretsmanager_secret.rds: Read complete after 1s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG]
data.aws_secretsmanager_secret_version.rds: Reading...
data.aws_secretsmanager_secret_version.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG|AWSCURRENT]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_log_group.web_api will be created
  + resource "aws_cloudwatch_log_group" "web_api" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/crawlinghub-web-api-prod"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "Service"     = "crawlinghub-web-api-prod"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api-prod"
        }
    }

  # aws_iam_role.ecs_task will be created
  + resource "aws_iam_role" "ecs_task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crawlinghub-web-api-task-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "crawlinghub"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task_execution will be created
  + resource "aws_iam_role" "ecs_task_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crawlinghub-web-api-execution-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "crawlinghub"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.eventbridge_access will be created
  + resource "aws_iam_role_policy" "eventbridge_access" {
      + id          = (known after apply)
      + name        = "crawlinghub-eventbridge-access-prod"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "events:PutEvents",
                          + "events:PutRule",
                          + "events:PutTargets",
                          + "events:DeleteRule",
                          + "events:RemoveTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.secrets_access will be created
  + resource "aws_iam_role_policy" "secrets_access" {
      + id          = (known after apply)
      + name        = "crawlinghub-secrets-access-prod"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:ap-northeast-2:*:parameter/shared/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_task_execution will be created
  + resource "aws_iam_role_policy_attachment" "ecs_task_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "crawlinghub-web-api-execution-role-prod"
    }

  # aws_lb.web_api will be created
  + resource "aws_lb" "web_api" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "crawlinghub-alb-prod"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (sensitive value)
      + tags                                                         = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-alb-prod"
          + "Service"     = "crawlinghub-web-api-prod"
        }
      + tags_all                                                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-prod"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api-prod"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags_all                                                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "crawlinghub"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_lb_listener.https will be created
  + resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (sensitive value)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags_all                                                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "crawlinghub"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.web_api will be created
  + resource "aws_lb_target_group" "web_api" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "crawlinghub-web-api-tg-prod"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-web-api-tg-prod"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-tg-prod"
          + "Project"     = "crawlinghub"
        }
      + target_type                        = "ip"
      + vpc_id                             = (sensitive value)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/actuator/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # aws_route53_record.web_api will be created
  + resource "aws_route53_record" "web_api" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "crawler.set-of.com"
      + type            = "A"
      + zone_id         = (sensitive value)

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP for redirect"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS from anywhere"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "crawlinghub-alb-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "crawlinghub-alb-sg-prod"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-sg-prod"
          + "Project"     = "crawlinghub"
        }
      + vpc_id                 = (sensitive value)
    }

  # aws_security_group.ecs_web_api will be created
  + resource "aws_security_group" "ecs_web_api" {
      + arn                    = (known after apply)
      + description            = "Security group for web-api ECS tasks"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "From ALB only"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "crawlinghub-web-api-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "crawlinghub-web-api-sg-prod"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-sg-prod"
          + "Project"     = "crawlinghub"
        }
      + vpc_id                 = (sensitive value)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_arn      = (known after apply)
  + alb_dns_name = (known after apply)
  + fqdn         = "crawler.set-of.com"
  + url          = "https://crawler.set-of.com"
╷
│ Error: reading ECR Repository (crawlinghub-web-api-prod): couldn't find resource
│ 
│   with data.aws_ecr_repository.web_api,
│   on main.tf line 11, in data "aws_ecr_repository" "web_api":
│   11: data "aws_ecr_repository" "web_api" {
│ 
╵
╷
│ Error: reading ECS Cluster (crawlinghub-cluster-prod): empty result
│ 
│   with data.aws_ecs_cluster.main,
│   on main.tf line 18, in data "aws_ecs_cluster" "main":
│   18: data "aws_ecs_cluster" "main" {
│ 
╵

```
</details>

---
### Plan Summary

5 projects, 2 with changes, 0 with no changes, 3 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```